//=====================================
// 四国高速道路 ICデータ
//=====================================

const roadData = {

    //=================================
    // 高松自動車道
    //=================================

    "高松自動車道":[

        "鳴門IC",
        "鳴門JCT",
        "板野IC",
        "引田IC",
        "白鳥大内IC",
        "津田東IC",
        "津田寒川IC",
        "志度IC",
        "さぬき三木IC",
        "高松東IC",
        "高松中央IC",
        "高松檀紙IC",
        "高松西IC",
        "府中湖SIC",
        "坂出JCT",
        "善通寺IC",
        "三豊鳥坂IC",
        "さぬき豊中IC",
        "観音寺SIC",
        "大野原IC",

    ],

    //=================================
    // 高松自動車道坂出支線
    //=================================

    "高松自動車道坂出支線":[

        "坂出JCT",
        "坂出IC"

    ],

    //=================================
    // 松山自動車道
    //=================================

    "松山自動車道":[

        "川之江JCT",
        "三島川之江IC",
        "土居IC",
        "新居浜IC",
        "いよ西条IC",
        "いよ小松JCT",
        "いよ小松IC",
        "東予丹原IC",
        "川内IC",
        "松山IC",
        "伊予IC",
        "中山SIC",
        "内子五十崎IC",
        "大洲IC",
        "大洲北只IC",
        "西予宇和",

    ],

    //=================================
    // 高知自動車道
    //=================================

    "高知自動車道":[

        "川之江JCT",
        "川之江東JCT",
        "新宮IC",
        "大豊IC",
        "南国IC",
        "高知IC",
        "伊野IC",
        "土佐IC",
        "須崎東IC"

    ],

    //=================================
    // 徳島自動車道
    //=================================

    "徳島自動車道":[

        "鳴門JCT",
        "松茂SIC",
        "徳島JCT",
        "徳島IC",
        "藍住IC",
        "土成IC",
        "脇町IC",
        "美馬IC",
        "吉野川SIC",
        "井川池田IC"

    ],

    //=================================
    // 徳島南部自動車道
    //=================================

    "徳島南部自動車道":[

        "徳島JCT",
        "徳島沖洲IC"

    ],

    //=================================
    // 今治小松自動車道
    //=================================

    "今治小松自動車道":[

        "いよ小松JCT",
        "いよ小松IC",
        "いよ小松北IC",
        "東予丹原IC",
        "今治湯ノ浦IC"

    ]

};